In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame(data=[11,12,32])
df

    0
0  11
1  12
2  32

In [8]:
df = pd.DataFrame(data=[11,12,32], index=[ 'first','second', 'third'], columns=['col_1'])
df

        col_1
first      11
second     12
third      32

In [10]:
df = pd.DataFrame(data={'WIG20': ['PKN_ORLEN', "PKO_BP"], "mWIG40": ['AMICA', "Playway"]})
df

       WIG20   mWIG40
0  PKN_ORLEN    AMICA
1     PKO_BP  Playway

In [11]:
df = pd.DataFrame(data=[[12,14,13],[23,12,10]], index = ['First','Second'], columns=['col_1', 'col_2', 'col_3'])

In [12]:
df

        col_1  col_2  col_3
First      12     14     13
Second     23     12     10

In [14]:
df.columns

Index(['col_1', 'col_2', 'col_3'], dtype='object')

In [15]:
df.index

Index(['First', 'Second'], dtype='object')

In [17]:
df.values

array([[12, 14, 13],
       [23, 12, 10]], dtype=int64)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, First to Second
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col_1   2 non-null      int64
 1   col_2   2 non-null      int64
 2   col_3   2 non-null      int64
dtypes: int64(3)
memory usage: 64.0+ bytes

In [20]:
df.describe().T

       count  mean       std   min    25%   50%    75%   max
col_1    2.0  17.5  7.778175  12.0  14.75  17.5  20.25  23.0
col_2    2.0  13.0  1.414214  12.0  12.50  13.0  13.50  14.0
col_3    2.0  11.5  2.121320  10.0  10.75  11.5  12.25  13.0

In [23]:
df['col_1']

First     12
Second    23
Name: col_1, dtype: int64

In [27]:
df.columns = ['a','b','c']

In [37]:
df['d'] = df['a'] + df['b']

In [43]:
df.loc['First']

pandas.core.series.Series

In [44]:
df

         a   b   c   d
First   12  14  13  26
Second  23  12  10  35

In [57]:
df.loc['First', 'b']

14